{
  "description": "Bukku.life為小型企業和個人工作室開發的線上預約系統，致力於提供高效的預約管理，讓您以最有效率的方式安排您的時間。為了保障您的權益，請詳細閱讀以下服務條款。",
  "content": [
    {
      "title": "認知與接受條款",
      "items": [
        "當您完成本系統的會員註冊手續或開始使用本服務時，即表示您已閱讀、瞭解並同意接受本服務條款的所有內容，包括現有和未來的服務項目和內容。",
        "本公司有權隨時修改或變更本服務條款的內容，修改後的條款將在網站上公佈，不會單獨通知您。您繼續使用本服務即表示您已接受修改後的條款。如果您不同意條款的修改或不接受其他任何條款，請停止使用本服務。",
        "若您年齡未滿二十歲或無完全行為能力，請在法定代理人或監護人閱讀、瞭解並同意本政策及其後的修改後方可使用本網站。使用或繼續使用本網站即表示您的法定代理人或監護人已閱讀、瞭解並同意本政策及其後的修改內容。",
        "當您完成註冊手續時，即代表您已同時授權本公司根據本服務條款和隱私權政策來收集、處理和使用您及您輸入的所有資料，並保證所輸入的會員資料是合法獲得的。",
        "拒絕提供必要的資料可能導致無法完整享受本系統的服務或完全無法使用本系統的服務。"
      ]
    },
    {
      "title": "資訊保護和安全",
      "items": [
        "您應妥善保管個人帳號和密碼。所有使用該帳號登入系統的行為都將視為帳號持有人的行為。",
        "如果您洩露自己的個人資料、密碼或付款資料，使第三方有機會使用它們，您必須對第三方的行為負全部責任。",
        "本公司採取合理的技術和組織措施，以保護您的個人資訊免受未經授權的訪問、使用、變更或披露。然而，請注意，互聯網上的資料傳輸並不是 100% 安全的，因此我們無法保證資訊的絕對安全。"
      ]
    },
    {
      "title": "營業人條款",
      "description": "",
      "items": [
        "營業資料\n為確保預約程序的順利完成，營業人應確保其在本系統上登記的個人/營業/匯款等相關資料與事實相符。如有變更，應立即通知本平台客服進行修改。",
        "資料保密\n營業人登錄的個人/營業資料將受到保密，除了應提供給本平台會員或與結帳相關的情況外，本公司有保密義務，不會隨意洩露或提供給第三方。",
        "帳號使用責任\n營業人應妥善保管其在本網站設定的帳號和密碼。所有使用該帳號登入系統的行為都將視為帳號持有人的行為。",
        "資料修改通知\n如營業人的資料發生變更，應立即在本系統內進行修改通知，以確保資訊的準確性。",
        "資金交易\n金流付款交易將直接由店家和用戶之間完成，本網站不介入或負責此類交易。",
        "損害賠償\n在特定情況下，本公司有權查看或提供本平台任何使用者的個人資料給有權機關或主張其權益受侵害並提出適當證明的第三方，包括法令規定、法院命令、執行本條款、維護平台運作和保護合法權益等情況。",
        "服務提供和費用\n營業人將透過匯款開通企業帳號，並在每個月底25-30號完成下個月的匯款。本公司將在下個月初5號前發送對帳明細至營業人在本系統設定的電子信箱。若逾期繳納，本網站有權直接暫停帳號權限。"
      ]
    },
    {
      "title": "消費者條款",
      "description": "購買課程或服務\n在使用本網站的預約功能時，即表示您擁有以下權利並同意遵守以下義務：",
      "items": [
        "認知和操作\n在使用本網站預約前，請確認使用指南，並完全了解本系統功能的操作方式，包括但不限於預約、排隊預約、開啟通知、確認預約成功或取消...等等。",
        "內容責任\n您應對您在本網站上的行為和發佈的內容負全責。您同意不會在本網站上發佈任何不當、冒犯性、侵犯他人權利的內容。",
        "金流交易\n金流付款交易將直接由店家和用戶之間完成，本網站不介入或負責此類交易。",
        "損害賠償\n如果本公司或各營業人違反本契約內容、合作宗旨或法律，導致對方受到損害，則應根據相關法律負擔損害賠償責任，包括但不限於損害賠償和律師費等一切損害、成本和支出。在解決爭議前，本公司有權暫停帳號權限。",
        "準據法與管轄法院\n本服務條款的解釋和適用，以及因交易行為而產生的任何爭議或糾紛，應依照中華民國法律處理，並以台灣台北地方法院為第一審管轄法院，除非法律有其他強制規定。",
        "其他\n本公司未行使或執行本服務條款中的任何權利或規定，不構成對前述權利或行使權的放棄。"
      ]
    }
  ]  
}