const LOCATION = { name: '台北店', address: '台北市中正區忠孝西路一段49號' };
const SUPPLIER = '安老師';

export const STUDIO_TIMES = ['10:00', '20:30'];
export const STUDIO_DURATION = 690;

export const SERVICE = {
  IN_PROGRESS: [
    {
      queue: true,
      attendee: 1,
      supplier: SUPPLIER,
      location: LOCATION,
      duration: 45,
      name: '2024 塔羅預約 - 45 分鐘',
      currentAttendee: 0,
      allday: true,
      serviceId: 10,
      startAt: '2024-01-01T10:00',
      endAt: '2024-12-31T00:00',
      description: `
      🔮 洞悉未來之旅 🔮
  【簡介】 
  歡迎蒞臨我們的塔羅預約！在這場神秘的旅程中，您將探索塔羅牌背後的奧秘與智慧。我們將引領您進入塔羅牌的世界。
  事業 🌕 感情 🌖 財富 🌔 心靈成長
  安老師將為您提供精準的解讀和個人化的指引，助您找到生活中的方向和平衡，啟動您的內在探索之旅！
  
  【服務費用】
  45 分鐘：800元
  60 分鐘：1000元 - 請至 60 分課程頁面中預約
  90 分鐘：1200元 - 請至 90 分課程頁面中預約
  付款方式：在預約確認後，我們將提供您專屬的付款帳號。請務必於收到付款帳號後的三天內完成付款程序，以確保您的訂單有效。逾期未完成付款者，將取消訂單。
  
  【預約限制】
  預約限制：每日名額有限，請盡早預約確保您的位置。
  人數限制：由於空間有限及隱私，不建議攜伴超過三人。若有特殊需求，請提前告知。
  為維護空間整潔及環境品質，請勿在教室內進食。
  
  【課程提醒】 
  這是一場個人尋找心靈指引的旅程。請確認您已了解上課地點的詳細地址和相關交通資訊，提前安排好您的交通方式，以確保準時抵達上課地點。`,
    },
    {
      queue: true,
      attendee: 1,
      supplier: SUPPLIER,
      location: LOCATION,
      duration: 60,
      name: '2024 塔羅預約 - 60 分鐘',
      currentAttendee: 0,
      allday: true,
      serviceId: 11,
      startAt: '2024-01-01T10:00',
      endAt: '2024-12-31T00:00',
      description: `
      🔮 洞悉未來之旅 🔮
  【簡介】 
  歡迎蒞臨我們的塔羅預約！在這場神秘的旅程中，您將探索塔羅牌背後的奧秘與智慧。我們將引領您進入塔羅牌的世界。
  事業 🌕 感情 🌖 財富 🌔 心靈成長
  安老師將為您提供精準的解讀和個人化的指引，助您找到生活中的方向和平衡，啟動您的內在探索之旅！
  
  【服務費用】
  45 分鐘：800元 - 請至 45 分課程頁面中預約
  60 分鐘：1000元 
  90 分鐘：1200元 - 請至 90 分課程頁面中預約
  付款方式：在預約確認後，我們將提供您專屬的付款帳號。請務必於收到付款帳號後的三天內完成付款程序，以確保您的訂單有效。逾期未完成付款者，將取消訂單。
  
  【預約限制】
  預約限制：每日名額有限，請盡早預約確保您的位置。
  人數限制：由於空間有限及隱私，不建議攜伴超過三人。若有特殊需求，請提前告知。
  為維護空間整潔及環境品質，請勿在教室內進食。
  
  【課程提醒】 
  這是一場個人尋找心靈指引的旅程。請確認您已了解上課地點的詳細地址和相關交通資訊，提前安排好您的交通方式，以確保準時抵達上課地點。`,
    },
    {
      queue: true,
      attendee: 1,
      supplier: SUPPLIER,
      location: LOCATION,
      duration: 240,
      name: '🔮 塔羅靈性啟發指導 🔮 ',
      currentAttendee: 0,
      allday: false,
      serviceId: 12,
      startAt: '2024-06-01T13:00',
      endAt: '2024-06-10T17:00',
      description: `
      【課程簡介】 
  歡迎您預約塔羅啟發培訓課程！這是一場塔羅深度培訓，專為您打造的個人化心靈探索之旅。在這四小時的課程中，您將與安老師深入探討塔羅牌的奧秘，學會如何解讀牌面的象徵意義，並掌握塔羅的應用技巧，啟發您的內在力量，指引您走向心靈成長之路。
  
  【服務費用】
  8,800元
  付款方式：在預約確認後，我們將提供您專屬的付款帳號。請在收到付款帳號後的三天內完成付款程序，以確保您的訂單有效。逾期未完成付款者，將取消訂單。
  
  【預約限制】
  預約限制：每月名額有限，請盡早預約確保您的位置。
  人數限制：課程設計為一對一培訓，提供專屬的學習體驗。
  
  【課程提醒】 
  這是一場個人化的心靈啟發之旅。請確認您已了解上課地點的詳細地址和相關交通資訊，提前安排好您的交通方式，以確保準時抵達上課地點。 
      `,
    },
  ],
  END: [
    {
      queue: true,
      attendee: 1,
      supplier: SUPPLIER,
      location: LOCATION,
      duration: 45,
      name: '2023 塔羅預約 - 45 分鐘',
      currentAttendee: 1,
      allday: true,
      serviceId: 5,
      startAt: '2023-01-01T10:00',
      endAt: '2023-12-31T00:00',
      description: `
      🔮 洞悉未來之旅 🔮
  【簡介】 
  歡迎蒞臨我們的塔羅預約！在這場神秘的旅程中，您將探索塔羅牌背後的奧秘與智慧。我們將引領您進入塔羅牌的世界。
  事業 🌕 感情 🌖 財富 🌔 心靈成長
  安老師將為您提供精準的解讀和個人化的指引，助您找到生活中的方向和平衡，啟動您的內在探索之旅！
  
  【服務費用】
  45 分鐘：800元
  60 分鐘：1000元 - 請至 60 分課程頁面中預約
  90 分鐘：1200元 - 請至 90 分課程頁面中預約
  付款方式：在預約確認後，我們將提供您專屬的付款帳號。請務必於收到付款帳號後的三天內完成付款程序，以確保您的訂單有效。逾期未完成付款者，將取消訂單。
  
  【預約限制】
  預約限制：每日名額有限，請盡早預約確保您的位置。
  人數限制：由於空間有限及隱私，不建議攜伴超過三人。若有特殊需求，請提前告知。
  為維護空間整潔及環境品質，請勿在教室內進食。
  
  【課程提醒】 
  這是一場個人尋找心靈指引的旅程。請確認您已了解上課地點的詳細地址和相關交通資訊，提前安排好您的交通方式，以確保準時抵達上課地點。`,
    },
    {
      queue: true,
      attendee: 1,
      supplier: SUPPLIER,
      location: LOCATION,
      duration: 60,
      name: '2023 塔羅預約 - 60 分鐘',
      currentAttendee: 0,
      allday: true,
      serviceId: 6,
      startAt: '2023-01-01T10:00',
      endAt: '2023-12-31T00:00',
      description: `
      🔮 洞悉未來之旅 🔮
  【簡介】 
  歡迎蒞臨我們的塔羅預約！在這場神秘的旅程中，您將探索塔羅牌背後的奧秘與智慧。我們將引領您進入塔羅牌的世界。
  事業 🌕 感情 🌖 財富 🌔 心靈成長
  安老師將為您提供精準的解讀和個人化的指引，助您找到生活中的方向和平衡，啟動您的內在探索之旅！
  
  【服務費用】
  45 分鐘：800元 - 請至 45 分課程頁面中預約
  60 分鐘：1000元 
  90 分鐘：1200元 - 請至 90 分課程頁面中預約
  付款方式：在預約確認後，我們將提供您專屬的付款帳號。請務必於收到付款帳號後的三天內完成付款程序，以確保您的訂單有效。逾期未完成付款者，將取消訂單。
  
  【預約限制】
  預約限制：每日名額有限，請盡早預約確保您的位置。
  人數限制：由於空間有限及隱私，不建議攜伴超過三人。若有特殊需求，請提前告知。
  為維護空間整潔及環境品質，請勿在教室內進食。
  
  【課程提醒】 
  這是一場個人尋找心靈指引的旅程。請確認您已了解上課地點的詳細地址和相關交通資訊，提前安排好您的交通方式，以確保準時抵達上課地點。`,
    },
    {
      queue: true,
      attendee: 1,
      supplier: SUPPLIER,
      location: LOCATION,
      duration: 240,
      name: '🔮 塔羅靈性啟發指導 🔮 ',
      currentAttendee: 0,
      allday: false,
      serviceId: 8,
      startAt: '2023-12-01T13:00',
      endAt: '2023-12-10T17:00',
      description: `
      【課程簡介】 
  歡迎您預約塔羅啟發培訓課程！這是一場塔羅深度培訓，專為您打造的個人化心靈探索之旅。在這四小時的課程中，您將與安老師深入探討塔羅牌的奧秘，學會如何解讀牌面的象徵意義，並掌握塔羅的應用技巧，啟發您的內在力量，指引您走向心靈成長之路。
  
  【服務費用】
  8,800元
  付款方式：在預約確認後，我們將提供您專屬的付款帳號。請在收到付款帳號後的三天內完成付款程序，以確保您的訂單有效。逾期未完成付款者，將取消訂單。
  
  【預約限制】
  預約限制：每月名額有限，請盡早預約確保您的位置。
  人數限制：課程設計為一對一培訓，提供專屬的學習體驗。
  
  【課程提醒】 
  這是一場個人化的心靈啟發之旅。請確認您已了解上課地點的詳細地址和相關交通資訊，提前安排好您的交通方式，以確保準時抵達上課地點。 
      `,
    },
  ],
} as const;

export const SERVICES = Object.values(SERVICE).flat();
